%拟合判别准则如 偏差绝对值之和最小,偏差最大绝对值最小和偏差平方和最小(即最下二乘法)
%polyfit函数或 cftool 命令打开图形拟合窗口界面
x=[1 2 3 4 5 6 7  8 9 ];
y=[9 7 6 3 -1 2 5 7 20];
p=polyfit(x,y,3);
%polyfit 多项式拟合,返回降幂排列的多项式系数,其中X,Y是数据点的值, N代表最高次幂
x1=0:0.2:20;
y1=polyval(p,x1);
% ployval代表返回的多项式系数,其中,P代表多项系数,想代表要求点分横坐标数值
plot(x1,y1,x,y,'r*')

%指点函数拟合
%如把f(t)=acos(kt)*exp(wt)作为拟合函数

syms t;
x2=[0 0.4 1.2 2 2.8 3.6 4.4 5.2 6 7.2 8 9.2 10.4 11.6 12.4 13.6 14.4 15]';
y2=[1 0.85 0.29 -0.27 -0.53 -0.4 -0.12 0.17 0.28 0.15 -0.03 -0.15 -0.071 ...
    0.059 0.08 0.032 -0.015 -0.02]';
f2=fittype('a*cos(k*t)*exp(w*t)','independent','t','coefficients',{'a','k','w'});
x2i=0:0.1:20;
cfun=fit(x2,y2,f2)
y2i=cfun(x2i);
figure
plot(x2,y2,'r*',x2i,y2i,'b-')
